Revit 2027 API
Element.CanHaveTypeAssigned Method
Overload List
Name | Description
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
CanHaveTypeAssigned(Document, ICollection<ElementId>) |  Checks if all elements in the set can have a type assigned.
Top
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace